SoCXin/AT32F407/src/SourceCode/RL-TCPNet_V1.0.0/RL-TCPNet-OS Example/RL-ARM/Driver/CAN_STM32F40x.c
/*
*********************************************************************************************************
*
*	模块名称 : CAN驱动
*	文件名称 : CAN_STM32F40x.c
*	版    本 : V1.0
*	说    明 : 本文件来自KEIL官方，为支持V6开发板，修改的地方
*              1. 修改CAN1使用的驱动引脚。
*              
*	修改记录 :
*		版本号    日期         作者            说明
*       V1.0    2017-02-28   Eric2013    1. RL-FlashFS版本V4.74
*
*	Copyright (C), 2015-2020, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/
/*----------------------------------------------------------------------------
 *      RL-ARM - CAN
 *----------------------------------------------------------------------------
 *      Name:    CAN_STM32F40x.c
 *      Purpose: CAN Driver, Hardware specific module for ST STM32F40x
 *      Rev.:    V4.70
 *----------------------------------------------------------------------------
 *      This code is part of the RealView Run-Time Library.
 *      Copyright (c) 2004-2013 KEIL - An ARM Company. All rights reserved.
 *---------------------------------------------------------------------------*/

#include <RTL.h>                      /* RTX kernel functions & defines      */
#include <RTX_CAN.h>                  /* CAN Generic functions & defines     */
#include <stm32f4xx.h>                /* STM32F40x register definitions      */


#define __CTRL1                 1
#define __CTRL2                 2

#define __FILTER_BANK_MAX      27     /* filter banks 0..27 */


/************************* CAN Hardware Configuration ************************/

// *** <<< Use Configuration Wizard in Context Menu >>> ***

// <o> CAN Peripheral Clock (in Hz) <1-1000000000>
//     <i> Same as APB1 clock
#define CAN_CLK               42000000

// *** <<< End of Configuration section             >>> ***


/*----------------------------------------------------------------------------
 *      CAN RTX Hardware Specific Driver Functions
 *----------------------------------------------------------------------------
 *  Functions implemented in this module:
 *    static      void CAN_set_timing      (U32 ctrl, U32 tseg1, U32 tseg2, U32 sjw, U32 brp)
 *    static CAN_ERROR CAN_hw_set_baudrate (U32 ctrl, U32 baudrate)
 *           CAN_ERROR CAN_hw_setup        (U32 ctrl)
 *           CAN_ERROR CAN_hw_init         (U32 ctrl, U32 baudrate)
 *           CAN_ERROR CAN_hw_start        (U32 ctrl)
 *           CAN_ERROR CAN_hw_testmode     (U32 ctrl, U32 testmode)
 *           CAN_ERROR CAN_hw_tx_empty     (U32 ctrl)
 *           CAN_ERROR CAN_hw_wr           (U32 ctrl,         CAN_msg *msg)
 *    static      void CAN_hw_rd           (U32 ctrl, U32 ch, CAN_msg *msg)
 *           CAN_ERROR CAN_hw_set          (U32 ctrl,         CAN_msg *msg)
 *           CAN_ERROR CAN_hw_rx_object    (U32 ctrl, U32 ch, U32 id, U32 object_para)
 *           CAN_ERROR CAN_hw_tx_object    (U32 ctrl, U32 ch,         U32 object_para)
 *    Interrupt fuction
 *---------------------------------------------------------------------------*/

/* Static functions used only in this module                                 */
static void CAN_hw_rd            (U32 ctrl, U32 ch, CAN_msg *msg);
static BOOL CAN_hw_rx_object_chk (U32 ctrl, U16 bank,         U32 object_para);
static void CAN_hw_rx_object_add (U32 ctrl, U16 bank, U32 id, U32 object_para);

/* CAN Controller Register Addresses                                         */
CAN_TypeDef *CAN_CTRL[] = { CAN1, CAN2 };

/* Static variables used only in this module                                 */
static U16 CAN1_filterIdx = 0;
static U16 CAN2_filterIdx = 0;

/************************* Auxiliary Functions *******************************/

/*--------------------------- CAN_set_timing --------------------------------
 *
 *  Setup the CAN timing with specific parameters
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *              tseg1:      Specifies Time Segment before the sample point
 *              tseg2:      Time Segment after the sample point
 *              sjw:        Synchronisation Jump Width
 *              brp:        Baud Rate Prescaler
 *
 *---------------------------------------------------------------------------*/

static void CAN_set_timing (U32 ctrl, U32 tseg1, U32 tseg2, U32 sjw, U32 brp) {
  CAN_TypeDef *CANx = CAN_CTRL[ctrl-1];

  CANx->BTR &= ~(((          0x03) << 24) | ((            0x07) << 20) | ((            0x0F) << 16) | (          0x3FF));
  CANx->BTR |=  ((((sjw-1) & 0x03) << 24) | (((tseg2-1) & 0x07) << 20) | (((tseg1-1) & 0x0F) << 16) | ((brp-1) & 0x3FF));
}


/*--------------------------- CAN_set_baudrate ------------------------------
 *
 *  Setup the requested baudrate
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *              baudrate:   Baudrate
 *
 *  Return:     CAN_ERROR:  Error code
 *---------------------------------------------------------------------------*/

static CAN_ERROR CAN_hw_set_baudrate (U32 ctrl, U32 baudrate)  {
  U32 brp;

  /* Note: this calculations fit for CAN_CLK = 42MHz                         */
  /* Determine which nominal time to use for requested baudrate and set
     appropriate bit timing                                                  */
  if (baudrate <= 1000000)  {
    brp  = (CAN_CLK / 7) / baudrate;

    /* Load the baudrate registers BTR                                       */
    /* so that sample point is at about 72% bit time from bit start          */
    /* TSEG1 = 4, TSEG2 = 2, SJW = 3 => 1 CAN bit = 7 TQ, sample at 71%      */
    CAN_set_timing(ctrl,  4, 2, 3, brp);
  }  else  {
    return CAN_BAUDRATE_ERROR;
  }

  return CAN_OK;
}


/*************************** Module Functions ********************************/

/*--------------------------- CAN_hw_setup ----------------------------------
 *
 *  Setup CAN transmit and receive PINs and interrupt vectors
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *
 *  Return:     CAN_ERROR:  Error code
 *---------------------------------------------------------------------------*/

CAN_ERROR CAN_hw_setup (U32 ctrl)  {

  switch (ctrl) {
    case 1: 
      #if USE_CAN_CTRL1 == 1   
		#if 1
			/* Enable clock for CAN1 and GPIOA */
			RCC->APB1ENR   |= (1 << 25);
			RCC->AHB1ENR   |= (1 <<  0);
		
			/* CAN1, use PA11, PA12 */
			GPIOA->MODER   &= ~(( 3 << ( 11 << 1)) | ( 3 << ( 12 << 1)));
			GPIOA->MODER   |=  (( 2 << ( 11 << 1)) | ( 2 << ( 12 << 1)));
			GPIOA->OTYPER  &= ~(( 1 <<   11)       | ( 1 <<   12      ));
			GPIOA->OSPEEDR &= ~(( 3 << ( 11 << 1)) | ( 3 << ( 12 << 1)));
			GPIOA->PUPDR   &= ~(( 3 << ( 11 << 1)) | ( 3 << ( 12 << 1)));
		
			GPIOA->AFR[1]  &= ~((15 << ( 3 << 2)) | (15 << ( 4 << 2)));
			GPIOA->AFR[1]  |=  (( 9 << ( 3 << 2)) | ( 9 << ( 4 << 2)));
		#else 
			RCC->APB1ENR   |= (1 << 25);
			RCC->AHB1ENR   |= (1 <<  1);
			
			/* CAN1, use PB8, PB9 */
			GPIOB->MODER   &= ~(( 3 << ( 8 << 1)) | ( 3 << ( 9 << 1)));
			GPIOB->MODER   |=  (( 2 << ( 8 << 1)) | ( 2 << ( 9 << 1)));
			GPIOB->OTYPER  &= ~(( 1 <<   8)       | ( 1 <<   9      ));
			GPIOB->OSPEEDR &= ~(( 3 << ( 8 << 1)) | ( 3 << ( 9 << 1)));
			GPIOB->PUPDR   &= ~(( 3 << ( 8 << 1)) | ( 3 << ( 9 << 1)));
		
			GPIOB->AFR[1]  &= ~((15 << ( 0 << 2)) | (15 << ( 1 << 2)));
			GPIOB->AFR[1]  |=  (( 9 << ( 0 << 2)) | ( 9 << ( 1 << 2)));
		#endif
	
        /* Enable CAN1 interrupts */
        NVIC_SetPriority (CAN1_TX_IRQn,  1);
        NVIC_SetPriority (CAN1_RX0_IRQn, 1);
        NVIC_EnableIRQ   (CAN1_TX_IRQn);
        NVIC_EnableIRQ   (CAN1_RX0_IRQn);
      #endif
      break;
    case 2: 
      #if USE_CAN_CTRL2 == 1
        /* Enable clock for CAN2 and GPIOB */
        RCC->APB1ENR   |= (1 << 25) | (1 << 26);
        RCC->AHB1ENR   |= (1 <<  1);
	
        /* CAN2, use PB12, PB13 */
        GPIOB->MODER   &= ~(( 3 << ( 12 << 1)) | ( 3 << (13 << 1)));
        GPIOB->MODER   |=  (( 2 << ( 12 << 1)) | ( 2 << (13 << 1)));
        GPIOB->OTYPER  &= ~(( 1 <<   12)       | ( 1 <<  13      ));
        GPIOB->OSPEEDR &= ~(( 3 << ( 12 << 1)) | ( 3 << (13 << 1)));
        GPIOB->PUPDR   &= ~(( 3 << ( 12 << 1)) | ( 3 << (13 << 1)));
        GPIOB->AFR[1]  &= ~ (15 << ( 4 << 2));
        GPIOB->AFR[1]  |=   ( 9 << ( 4 << 2));
        GPIOB->AFR[1]  &= ~ (15 << ( 5 << 2));
        GPIOB->AFR[1]  |=   ( 9 << ( 5 << 2));
	
