SoCXin/AT32F407/src/SourceCode/RL-TCPNet_V1.0.0/RL-TCPNet-OS Example/RL-ARM/Driver/CAN_STM32F40x.c
/*--------------------------- CAN_hw_rx_object_chk --------------------------
 *
 *  This function checks if an object that is going to be used for the message 
 *  reception can be added to the Filter Bank
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *              bank:       Index of the Filter bank (0..__FILTER_BANK_MAX)
 *              object_para:Object parameters (standard or extended format, 
 *                          data or remote frame)
 *
 *  Return:     BOOL:  True   Object can     be added to Filter Bank
 *                     False  Object can not be added to Filter Bank
 *---------------------------------------------------------------------------*/

BOOL CAN_hw_rx_object_chk (U32 ctrl, U16 bank, U32 object_para)  {
  CAN_TypeDef *CANx = CAN_CTRL[0];

  if ((CANx->FA1R & (1UL << bank)) == 0) {                            /* filter bank unused ? */
    return __TRUE;
  }
  else {
    /* check if another identifier is possible */
    if      (((CANx->FS1R & (1UL << bank)) == 0) &&                   /* 16-bit identifier format is used */
            ((object_para & FORMAT_TYPE) == STANDARD_TYPE)) {         /* Standard identifier must be added */
      /* check filter bank for free 16 bit filter */
                                                                      /*          position n+0 is always used */
      if      ((CANx->sFilterRegister[bank].FR1 & 0xFFFF0000) == 0) { /* check if position n+1 is used */
        return __TRUE;
      }
      else if ((CANx->sFilterRegister[bank].FR2 & 0x0000FFFF) == 0) { /* check if position n+2 is used */
        return __TRUE;
      }
      else if ((CANx->sFilterRegister[bank].FR2 & 0xFFFF0000) == 0) { /* check if position n+3 is used */
        return __TRUE;
      }
 
    }
    else if (((CANx->FS1R & (1UL << bank)) != 0) &&                   /* 32-bit identifier format is used */
            ((object_para & FORMAT_TYPE) == EXTENDED_TYPE)) {         /* Extended identifier must be added */
      /* check filter bank for free 32 bit filter */
                                                                      /*          position n+0 is always used */
      if      ((CANx->sFilterRegister[bank].FR2             ) == 0) { /* check if position n+1 is used */
        return __TRUE;
      }
    }

  }

  return __FALSE;
}

/*--------------------------- CAN_hw_rx_object_add --------------------------
 *
 *  This function adds an object that is going to be used for the message 
 *  reception to the Filter Bank
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *              bank:       Index of the Filter bank (0..__FILTER_BANK_MAX)
 *              id:         Identifier of receiving messages
 *              object_para:Object parameters (standard or extended format, 
 *                          data or remote frame)
 *
 *  Return:     none
 * *---------------------------------------------------------------------------*/

void CAN_hw_rx_object_add (U32 ctrl, U16 bank, U32 id, U32 object_para)  {
  CAN_TypeDef *CANx = CAN_CTRL[0];
  U32 can2sb;

  CANx->FMR  |=  (1 << 0);                                            /* set Initialisation mode for filter banks */

  if ((CANx->FA1R & (1UL << bank)) == 0) {                            /* filter bank unused ? */
                                                                      /* add identifier */
    if ((object_para & FORMAT_TYPE) == STANDARD_TYPE)  {              /* Standard format used */ 
      CANx->FM1R |=  (1UL << bank);                                   /* Two 32-bit registers of filter bank x are in Identifier List mode */
      CANx->FS1R &= ~(1UL << bank);                                   /* Dual 16-bit scale configuration */

      CANx->sFilterRegister[bank].FR1 = (U32)(id << 5) |              /* 16-bit identifier */
                           ((object_para & FRAME_TYPE) << 3);         /* RTR bit */
      CANx->sFilterRegister[bank].FR2 = 0;                            /* empty */
    }
    else {                                                            /* Extended format used */
      CANx->FM1R |=  (1UL << bank);                                   /* Two 32-bit registers of filter bank x are in Identifier List mode */
      CANx->FS1R |=  (1UL << bank);                                   /* Single 32-bit scale configuration */

      CANx->sFilterRegister[bank].FR1 = (U32)(id << 3) | (1 << 2) |   /* 32-bit identifier */
                           (object_para & FRAME_TYPE);                /* RTR bit */
      CANx->sFilterRegister[bank].FR2 = 0;                            /* empty */
    }

    if (ctrl == __CTRL1)                                              /* increase filter number depending on CAN controller */
      CAN1_filterIdx++;
    else
      CAN2_filterIdx++;

  }
  else {                                                              /* filter bank used */
    /* check for free position */
    if      (((CANx->FS1R & (1UL << bank)) == 0) &&                   /* 16-bit identifier format is used */
             ((object_para & FORMAT_TYPE) == STANDARD_TYPE)) {        /* Standard identifier must be added */
      /* check filter bank for free 16 bit filter */
                                                                      /*          position n+0 is always used */
      if      ((CANx->sFilterRegister[bank].FR1 & 0xFFFF0000) == 0) { /* check if position n+1 is used */
        CANx->sFilterRegister[bank].FR1 |= (((U32)(id << 5)) |        /* store 16-bit identifier on position n+1 */
                             ((object_para & FRAME_TYPE) << 3)) << 16;/* RTR bit */
      }
      else if ((CANx->sFilterRegister[bank].FR2 & 0x0000FFFF) == 0) { /* check if position n+2 is used */
        CANx->sFilterRegister[bank].FR2  =  ((U32)(id << 5)) |        /* store 16-bit identifier on position n+2 */
                             ((object_para & FRAME_TYPE) << 3);       /* RTR bit */
      }
      else if ((CANx->sFilterRegister[bank].FR2 & 0xFFFF0000) == 0) { /* check if position n+3 is used */
        CANx->sFilterRegister[bank].FR2 |= (((U32)(id << 5)) |        /* store 16-bit identifier on position n+3 */
                             ((object_para & FRAME_TYPE) << 3)) << 16;/* RTR bit */
      }
    }
    else if (((CANx->FS1R & (1UL << bank)) != 0) &&                   /* 32-bit identifier format is used */
             ((object_para & FORMAT_TYPE) == EXTENDED_TYPE)) {        /* Extended identifier must be added */
      /* check filter bank for free 32 bit filter */
                                                                      /*          position n+0 is always used */
      if      ((CANx->sFilterRegister[bank].FR2             ) == 0) { /* check if position n+1 is used */
        CANx->sFilterRegister[bank].FR2 = (U32)(id << 3) | (1 << 2) | /* store 32-bit identifier on position n+1 */
                             (object_para & FRAME_TYPE);              /* RTR bit */
      }
    }
  }

  CANx->FFA1R &= ~(1UL << bank);                                      /* assign filter to FIFO 0 */
  CANx->FA1R  |=  (1UL << bank);                                      /* activate filter */
  can2sb = (CAN2_filterIdx == 0) ? __FILTER_BANK_MAX : (__FILTER_BANK_MAX - (CAN2_filterIdx - 1));
  CANx->FMR    =  ((can2sb) << 8);                                    /* reset Initialisation mode for filter banks */
                                                                      /* and  set CAN2 start bank */
}

/*--------------------------- CAN_hw_rx_object ------------------------------
 *
 *  This function setups object that is going to be used for the message 
 *  reception
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *              ch:         Index of object used for reception
 *              id:         Identifier of receiving messages
 *              object_para:Object parameters (standard or extended format, 
 *                          data or remote frame)
 *
 *  Return:     CAN_ERROR:  Error code
 *---------------------------------------------------------------------------*/

CAN_ERROR CAN_hw_rx_object (U32 ctrl, U32 ch, U32 id, U32 object_para)  {
  U16 CAN_filterBnk = 0;
  U16 CAN_filterIdx = 0;
  
  /* find free filter */
  switch (ctrl) {
    case __CTRL1:        /* for CTRL1 we check from 0 .. __FILTER_BANK_MAX - CAN2_filterIdx */
      CAN_filterIdx = (CAN2_filterIdx == 0) ? __FILTER_BANK_MAX : __FILTER_BANK_MAX - CAN2_filterIdx - 1; 

      for (CAN_filterBnk = 0; CAN_filterBnk < CAN_filterIdx; CAN_filterBnk++) {
        if (CAN_hw_rx_object_chk (ctrl, CAN_filterBnk, object_para) == __TRUE) {
          CAN_hw_rx_object_add (ctrl, CAN_filterBnk, id, object_para);
          break;                                    /* stop the loop if we have added the object */
        }
      }
      break;

    case __CTRL2:        /* for CTRL2 we check from __FILTER_BANK_MAX .. [1 | CAN1_filterIdx] */
      CAN_filterIdx = (CAN1_filterIdx == 0) ? 0 : CAN1_filterIdx - 1; 

